ХМНПФ_Общее/Documents/пдс_ПоступлениеВзносовПДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>пдс_ПоступлениеВзносовПДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСписков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокСчетов</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Documents/пдс_ПоступлениеВзносовПДС/Ext/ObjectModule.bsl
&После("ПроверкаКорректности")
Процедура ХМПроверкаКорректности(Отказ, Заголовок)
	// ХМНПФ+ 28.08.2024 ЛыткинАМ // Запрет поступлений по не заверщенному договору // №3921
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
      |	пдс_ПоступлениеВзносовПДССписокСчетов.НомерСчета КАК НомерСчета,
      |	СУММА(пдс_ПоступлениеВзносовПДССписокСчетов.СуммаВзноса) КАК СуммаВзноса,
      |	СУММА(0) КАК СуммаНаОУД,
      |	СУММА(0) КАК СуммаСР
      |ПОМЕСТИТЬ ВТ_Данные
      |ИЗ
      |	Документ.пдс_ПоступлениеВзносовПДС.СписокСчетов КАК пдс_ПоступлениеВзносовПДССписокСчетов
      |ГДЕ
      |	пдс_ПоступлениеВзносовПДССписокСчетов.Ссылка = &Ссылка
      |
      |СГРУППИРОВАТЬ ПО
      |	пдс_ПоступлениеВзносовПДССписокСчетов.НомерСчета
      |;
      |
      |////////////////////////////////////////////////////////////////////////////////
      |ВЫБРАТЬ
      |	ВТ_Данные.НомерСчета.Владелец КАК ПенсионныйДоговор,
      |	ВТ_Данные.НомерСчета КАК НомерСчета,
      |	пдс_СостоянияДоговораПДС.Состояние КАК СостояниеДоговора
      |ИЗ
      |	ВТ_Данные КАК ВТ_Данные
      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пдс_СостоянияДоговораПДС КАК пдс_СостоянияДоговораПДС
      |		ПО ВТ_Данные.НомерСчета.Владелец = пдс_СостоянияДоговораПДС.ДоговорПДС
		|	И пдс_СостоянияДоговораПДС.Период < &Период
    	|	И НЕ пдс_СостоянияДоговораПДС.Регистратор = &Ссылка
		|
	  |ГДЕ пдс_СостоянияДоговораПДС.Состояние ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("Период",  ?(ЗначениеЗаполнено(ДатаСписков), МАКС(КонецДня(ДатаСписков),Дата), Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтрСообщения = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрСообщения = СтрСообщения+"По счету " + ВыборкаДетальныеЗаписи.НомерСчета + " на дату поступления ДС еще не заключен договор.";
		Отказ = Истина;
	КонецЦикла;
	Если ЗначениеЗаполнено(СтрСообщения) Тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(СтрСообщения,,Заголовок);
	КонецЕсли;
	// ХМНПФ- 28.08.2024 ЛыткинАМ // Запрет поступлений по не заверщенному договору // №3921
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура ХМОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	Если (ДанныеЗаполнения = Неопределено) ИЛИ Не ЭтотОбъект.Метаданные().Реквизиты.ДокументОснование.Тип.СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда
		Возврат;
	КонецЕсли;
	Организация = ДанныеЗаполнения.Организация;
	Дата        = ДанныеЗаполнения.Дата;
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	ДатаСписков = ДанныеЗаполнения.Дата;
	Плательщик  = ДанныеЗаполнения.Контрагент;
	ПодразделениеОрганизации = ДанныеЗаполнения.ПодразделениеОрганизации;
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		ДатаВходящегоДокумента      = ДокументОснование.ДатаВходящегоДокумента;
		НомерВходящегоДокумента     = ДокументОснование.НомерВходящегоДокумента;
		Если ДокументОснование.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.уп_СберегательныеВзносыПДС Тогда
			ТипСуммы = Справочники.пдс_ТипыСуммПДС.Сберегательный;
		ИначеЕсли ДокументОснование.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.уп_ПоступлениеДСВПДС Тогда
			ТипСуммы = Справочники.пдс_ТипыСуммПДС.ДополнительныйСтимулирующий;
			ЭтоНераспределенныйПлатеж = Истина;
		КонецЕсли;
		КатегорияВзноса = Документы.пдс_ПоступлениеВзносовПДС.КатегорияВзноса(ЭтотОбъект);
	Иначе
		ДатаВходящегоДокумента      = ДокументОснование.Дата;
		НомерВходящегоДокумента     = ДокументОснование.Номер;
	КонецЕсли;	
#Вставка
	ТипСуммы = Справочники.пдс_ТипыСуммПДС.Сберегательный;

//	уп_ВидДеятельности = ДанныеЗаполнения.уп_ВидДеятельности;
	
	Для каждого стр из ДанныеЗаполнения.РасшифровкаПлатежа Цикл
		СтрокаДокумента = СписокСчетов.Добавить();
		Попытка
			СтрокаДокумента.НомерСчета = стр.ДоговорКонтрагента.уп_Договор.ПенсионныйСчет;
		Исключение
			СтрокаДокумента.СуммаВзноса = стр.СуммаПлатежа;
		КонецПопытки;
	КонецЦикла;	
#КонецВставки
КонецПроцедуры
